Core/src/InformationRegisters/СтатусыИнформированияГИСМ/СтатусыИнформированияГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыИнформированияГИСМ</name>
  <resources>
    <name>ТекущееУведомление</name>
    <type>
      <types>DocumentRef.УведомлениеОбИмпортеМаркированныхТоваровГИСМ</types>
      <types>DocumentRef.УведомлениеОСписанииКиЗГИСМ</types>
      <types>DocumentRef.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыИнформированияГИСМ</types>
    </type>
  </resources>
  <resources>
    <name>ДальнейшееДействие</name>
    <type>
      <types>EnumRef.ДальнейшиеДействияПоВзаимодействиюГИСМ</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ДокументИнформированияГИСМ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/СтатусыИнформированияГИСМ/СтатусыИнформированияГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыИнформированияГИСМ</name>
  <enumValues>
    <name>Отсутствует</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>КПередаче</name>
  </enumValues>
  <enumValues>
    <name>КПередачеСписаниеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>КПередачеМаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>КПередачеПеремаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>Передано</name>
  </enumValues>
  <enumValues>
    <name>ПереданоСписаниеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>ПереданоМаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПереданоПеремаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоГИСМСписаниеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоГИСММаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоГИСМПеремаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПринятоГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ПринятоГИСМСписаниеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>ПринятоГИСММаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПринятоГИСМПеремаркировкаТоваров</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ДальнейшиеДействияПоВзаимодействиюГИСМ/ДальнейшиеДействияПоВзаимодействиюГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДальнейшиеДействияПоВзаимодействиюГИСМ</name>
  <enumValues>
    <name>ЗакройтеЗаявку</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеПолучение</name>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
  <enumValues>
    <name>ПередайтеДанные</name>
  </enumValues>
  <enumValues>
    <name>ПередайтеДанныеСписаниеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>ПередайтеДанныеМаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПередайтеДанныеПеремаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>Аннулируйте</name>
  </enumValues>
  <enumValues>
    <name>ВыполнитеОбмен</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеПередачуДанныхРегламентнымЗаданием</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеПолучениеКвитанцииОФиксации</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеФормированиеСчетаНаОплату</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеПодтверждениеПолучения</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеУтверждениеФНС</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеПоступлениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ИсправьтеНекорректныеРеквизиты</name>
  </enumValues>
  <enumValues>
    <name>ПолучитеСчетНаОплату</name>
  </enumValues>
  <enumValues>
    <name>ОплатитеСчет</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеУведомлениеОВыпускеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеРегистрациюКлиентаВГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеЗакрытияУведомления</name>
  </enumValues>
</mdclass:Enum>

Core/src/CommonModules/МаркировкаТоваровГИСМ/Module.bsl
#Область ПрограммныйИнтерфейс

// Обновляет информацию о статусе ГИСМ на форме документа
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой необходимо обновить статус ГИСМ
//  ИмяДокумента - Строка - Имя документа, для которого необходимо определить статус ГИСМ
//
Процедура ОбновитьСтатусГИСМ(Форма, ИмяДокумента) Экспорт
	
	Форма.СтатусГИСМ          = Перечисления.СтатусыИнформированияГИСМ.Черновик;
	Форма.ДальнейшееДействие  = Перечисления.ДальнейшиеДействияПоВзаимодействиюГИСМ.ПустаяСсылка();
	
	Если НЕ Форма.Объект.Ссылка.Пустая() Тогда
		
		Запрос = Новый Запрос;
		ТекстЗапроса = "ВЫБРАТЬ
		|	ЕСТЬNULL(СтатусыИнформированияГИСМ.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияГИСМ.Черновик)) КАК СтатусИнформированияГИСМ,
		|	ВЫБОР
		|		КОГДА СтатусыИнформированияГИСМ.ДальнейшееДействие В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюГИСМ.ПустаяСсылка)
		|		ИНАЧЕ ЕСТЬNULL(СтатусыИнформированияГИСМ.ДальнейшееДействие, &ДальнейшееДействие)
		|	КОНЕЦ КАК ДальнейшееДействие
		|ИЗ
		|	Документ.%ИмяДокумента% КАК МаркировкаТоваровГИСМ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыИнформированияГИСМ КАК СтатусыИнформированияГИСМ
		|		ПО (СтатусыИнформированияГИСМ.Документ = МаркировкаТоваровГИСМ.Ссылка)
		|ГДЕ
		|	МаркировкаТоваровГИСМ.Ссылка = &Ссылка";
		
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "%ИмяДокумента%", ИмяДокумента);
		
		Запрос.УстановитьПараметр("Ссылка",                   Форма.Объект.Ссылка);
		Запрос.УстановитьПараметр("МассивДальнейшиеДействия", ИнтеграцияГИСМ.НеотображаемыеВДокументахДальнейшиеДействия());
		
		Если ИмяДокумента = "ПеремаркировкаТоваровГИСМ" Тогда
			Запрос.УстановитьПараметр("ДальнейшееДействие", Перечисления.ДальнейшиеДействияПоВзаимодействиюГИСМ.ПередайтеДанныеСписаниеКиЗ);
		Иначе
			Запрос.УстановитьПараметр("ДальнейшееДействие", Перечисления.ДальнейшиеДействияПоВзаимодействиюГИСМ.ПередайтеДанные);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Форма.СтатусГИСМ         = Выборка.СтатусИнформированияГИСМ;
			Форма.ДальнейшееДействие = Выборка.ДальнейшееДействие;
		КонецЕсли;
		
	Иначе
		
		Если ИмяДокумента = "ПеремаркировкаТоваровГИСМ" Тогда
			Форма.ДальнейшееДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюГИСМ.ПередайтеДанныеСписаниеКиЗ;
		Иначе
			Форма.ДальнейшееДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюГИСМ.ПередайтеДанные;
		КонецЕсли;
		
	КонецЕсли;
	
	ДопустимыеДействия = Новый Массив;
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияПоВзаимодействиюГИСМ.ПередайтеДанные);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияПоВзаимодействиюГИСМ.ПередайтеДанныеМаркировкаТоваров);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияПоВзаимодействиюГИСМ.ПередайтеДанныеПеремаркировкаТоваров);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияПоВзаимодействиюГИСМ.ПередайтеДанныеСписаниеКиЗ);
	
	Форма.СтатусГИСМПредставление = ИнтеграцияГИСМ.ПредставлениеСтатусаГИСМ(
		Форма.СтатусГИСМ,
		Форма.ДальнейшееДействие,
		ДопустимыеДействия);
	
КонецПроцедуры

// Устанавливает/скрывает видимость полей в зависимости от операции идентификации
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой необходимо управление видимостью
//
Процедура УправлениеДоступностью(Форма) Экспорт
	
	ОперацияИдентификации = Форма.ОперацияИдентификации;
	
	Форма.Элементы.КиЗГИСМВид.Видимость = НЕ ОперацияИдентификации;
	Форма.Элементы.КиЗГИСМСпособВыпускаВОборот.Видимость = НЕ ОперацияИдентификации;
	Форма.Элементы.КиЗГИСМРазмер.Видимость = НЕ ОперацияИдентификации;
	Форма.Элементы.КиЗГИСМСИндивидуализацией.Видимость = НЕ ОперацияИдентификации;
	
	Форма.Элементы.ТоварыНоменклатураКиЗ.Видимость = НЕ ОперацияИдентификации;
	Форма.Элементы.ТоварыХарактеристикаКиЗ.Видимость = НЕ ОперацияИдентификации;
	
КонецПроцедуры

// Устанавливает/скрывает видимость полей в зависимости от операции идентификации
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - Документ, в котором необходимо проверить соответствие GTIN КиЗ и товара 
//  Отказ - Булево - Признак, указывающий на необходимость установки стандартного флага Отказ при проверке
//
Процедура ПроверитьСоответствияGTIN(ДокументОбъект, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	Товары.НомерСтроки,
		|	Товары.НоменклатураКиЗ,
		|	Товары.ХарактеристикаКиЗ,
		|	Товары.Номенклатура,
		|	Товары.Характеристика,
		|	Товары.GTIN
		|ПОМЕСТИТЬ ВтТовары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.НомерСтроки,
		|	Товары.НоменклатураКиЗ,
		|	Товары.ХарактеристикаКиЗ,
		|	Товары.Номенклатура,
		|	Товары.Характеристика,
		|	Товары.GTIN,
		|	ЕСТЬNULL(Товары.ХарактеристикаКиЗ.КиЗГИСМGTIN, Товары.НоменклатураКиЗ.КиЗГИСМGTIN) КАК GTINКИЗ
		|ИЗ
		|	ВтТовары КАК Товары
		|ГДЕ
		|	ЕСТЬNULL(Товары.ХарактеристикаКиЗ.КиЗГИСМGTIN, Товары.НоменклатураКиЗ.КиЗГИСМGTIN) <> Товары.GTIN
		|	И НЕ ЕСТЬNULL(Товары.ХарактеристикаКиЗ.КиЗГИСМGTIN, Товары.НоменклатураКиЗ.КиЗГИСМGTIN) ПОДОБНО """"
		|";
		
	Запрос.УстановитьПараметр("Товары", ДокументОбъект.Товары.Выгрузить());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ШаблонСообщения = НСтр("ka='GTIN КиЗ %1 %2 отличается от GTIN товара %3 в строке %4.';ru='GTIN КиЗ %1 %2 отличается от GTIN товара %3 в строке %4.'");
		ПредставлениеНоменклатурыКиз = 1;
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСообщения,
			ИнтеграцияГИСМПереопределяемый.ПредставлениеНоменклатуры(Выборка.НоменклатураКиЗ, Выборка.ХарактеристикаКиЗ),
				СокрЛП(Выборка.GTINКИЗ),
			ИнтеграцияГИСМПереопределяемый.ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика),
				СокрЛП(Выборка.GTIN));
			
		НомерСтроки = Выборка.НомерСтроки - 1;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			ДокументОбъект.Ссылка,
			"Объект.Товары[" + НомерСтроки + "].GTIN",
			,
			Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
